Documents/ПоступлениеТоваровНаОтветственноеХранение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровНаОтветственноеХранение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХраненияПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХранения</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыТОХпоДаннымПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщикуБезРазбораВГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаТовараНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорГрузополучателяТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыкупаСОтветственногоХранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыкупСОтветственногоХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаперемещениеВОП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПТОХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитнаяПоставкаЧерезСкладWMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ) </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыТОХпоДаннымПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыТОХпоДаннымПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваровНаОтветственноеХранение/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУказаниеСкладовВТЧ Экспорт;
Перем мУдалятьДвижения;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	//Товары на складах 
	НаборДвижений = Движения.ТоварыНаСкладах;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
		
	КонецЦикла;	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыНаСкладах.ВыполнитьПриход();
	КонецЕсли;
	
	//+Шульман А. 16.12.2024 #UT10-4995
	Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина 
	   И ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП Тогда  
	   // Не делать движение по ТоварыОтветственногоХранения
	//-Шульман А. 16.12.2024 #UT10-4995
	   
	Иначе
		//Товары ответственного хранения 
		НаборДвижений = Движения.ТоварыОтветственногоХранения;
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
			
		КонецЦикла;	
		
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ТоварыОтветственногоХранения.ВыполнитьПриход();
		КонецЕсли;  
		
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;	
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	Для Каждого СтрокаТовары Из Товары Цикл
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
	КонецЦикла;	
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер"); 
	ТаблицаДвижений.ЗаполнитьЗначения(Склад,"Склад");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	СтруктураУП = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ТекущаяДата(), Отказ, , "Упр"); 
	
	Если Не Отказ Тогда
		ВестиУчетТоваровОрганизацийВРазрезеСкладов = СтруктураУП.ВестиУчетТоваровОрганизацийВРазрезеСкладов;
	КонецЕсли;
	
	Если Не ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда                  
		
		//+Шульман А. 16.12.2024 #UT10-4995
		Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина 
		   И ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП Тогда   
		   
			ДвиженияПоРегиструТоварыОтветственногоХраненияПереданные(Отказ);		  
		//-Шульман А. 16.12.2024 #UT10-4995
		   
		Иначе
			ВыполнитьДвижениеПоРегиструТОХП(Отказ);   
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
	//+Кабанов А.В. 15.07.2025 # UT10-5323
	// ТОВАР ПО РЕГИСТРУ ЗаказыПоставщикам.
	НаборДвижений = Движения.ЗаказыПоставщикам;	
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Для Каждого СтрокаТовары Из Товары Цикл 
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
		СтрокаДвижений.СуммаВзаиморасчетов = СтрокаТовары.Сумма;
		СтрокаДвижений.СуммаУпр            = СтрокаТовары.Сумма;
		//+Гавриленков В. 18.12.2025 #UT10-5598
		//СтрокаДвижений.СтавкаНДС           = СтрокаТовары.Номенклатура.СтавкаНДС;
		СтрокаДвижений.СтавкаНДС           = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтрокаТовары.Номенклатура, Дата);
		//-Гавриленков В. 18.12.2025 #UT10-5598
		
	КонецЦикла;

	СтруктТаблицДокумента = Новый Структура;
	СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      ТаблицаДвижений);
	
	ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ЗаказыПоставщикам, СтруктТаблицДокумента);
	
	ОбщегоНазначения.УдалитьСтрокиИзТаблицДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику");
	
	Для Каждого СтрокаДвижений Из ТаблицыДанныхДокумента.ТаблицаПоТоварам Цикл 
		СтрокаДвижений.ДоговорКонтрагента  = СтрокаДвижений.ЗаказПоставщику.ДоговорКонтрагента;		
	КонецЦикла;
	
	ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.Купленный, "ТаблицаПоТоварам");
	
	ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ЗаказыПоставщикам, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
	
	//-Кабанов А.В. 15.07.2025 # UT10-5323

	//+Кабанов А.В. 12.11.2024 #UT10-4872
	Если Не Отказ Тогда
		Если МСКWEB.ЗначениеДопСвойства(Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки) = Неопределено Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки,Перечисления.СтатусыПриемки.ВПути);
		КонецЕсли;
	КонецЕсли;
	//-Кабанов А.В. 12.11.2024 #UT10-4872
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;

	НепроверяемыеРеквизиты.Добавить("ДатаВходящегоДокумента");
	НепроверяемыеРеквизиты.Добавить("НомерВходящегоДокумента");
    НепроверяемыеРеквизиты.Добавить("НомерСкладскогоДокумента");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ); 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДДокументаВСмежнойБазе = "";
	
КонецПроцедуры

Процедура ВыполнитьДвижениеПоРегиструТОХП(Отказ)
	
	НаборДвижений = Движения.ТоварыТОХпоДаннымПоставщиков;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
		
	КонецЦикла;	
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Контрагент");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "Договор");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыТОХпоДаннымПоставщиков.ВыполнитьПриход();
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ОтправитьВОП(Отказ);
	КонецЕсли;

КонецПроцедуры     

Процедура ДвиженияПоРегиструТоварыОтветственногоХраненияПереданные(Отказ)	
	
	//+Шульман А. 16.12.2024 #UT10-4995
	НаборДвижений = Движения.ТоварыОтветственногоХраненияПереданные;	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 

    ЗапросДвиженийТоварыТОХПереданные = Новый Запрос;
	ЗапросДвиженийТоварыТОХПереданные.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка.Организация КАК Организация,
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка.Филиал КАК Филиал,
	|	ПоступлениеТоваровНаОтветственноеХранение.Номенклатура,
	|	ПоступлениеТоваровНаОтветственноеХранение.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровНаОтветственноеХранение.СерияНоменклатуры,
	|	ПоступлениеТоваровНаОтветственноеХранение.Количество
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранение
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка = &Ссылка";
	
	ЗапросДвиженийТоварыТОХПереданные.УстановитьПараметр("Ссылка",Ссылка);
	
	ПромТаблицаДвижений = ЗапросДвиженийТоварыТОХПереданные.Выполнить().Выгрузить();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ПромТаблицаДвижений, ТаблицаДвижений);
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;			
	
	Если Не Отказ Тогда
		Движения.ТоварыОтветственногоХраненияПереданные.ВыполнитьРасход();
	КонецЕсли;
	//-Шульман А. 16.12.2024 #UT10-4995

КонецПроцедуры

Процедура ОтправитьВОП(Отказ) Экспорт 
	
	ЯчейкаВиртуальногоРазмещенияТОХ = Константы.ЯчейкаДляВиртуальногоРазмещенияТОХ.Получить();

	Если  НЕ ЗначениеЗаполнено(ГрузополучательТОХ) Или НЕ ЗначениеЗаполнено(ДоговорГрузополучателяТОХ) 
		ИЛИ НЕ ЗначениеЗаполнено(ЯчейкаВиртуальногоРазмещенияТОХ) ИЛИ ЗначениеЗаполнено(ЗаказНаперемещениеВОП)  Тогда
		Возврат;
	КонецЕсли;         
	
	//Создаем документ размещение по ячейкам
	СоздаемРазмещение = Истина;
	
	ЕстьДокументРазмещения = Документы.РазмещениеПоЯчейкам.НайтиПоРеквизиту("ДокументОснование",Ссылка);
	
	Если ЗначениеЗаполнено(ЕстьДокументРазмещения) И ЕстьДокументРазмещения.Проведен Тогда
		СоздаемРазмещение = Ложь;
	КонецЕсли;
	
	Если СоздаемРазмещение Тогда
		
		НовыйДокументРазмещение                          = Документы.РазмещениеПоЯчейкам.СоздатьДокумент();
		НовыйДокументРазмещение.ДокументОснование        = Ссылка;
		НовыйДокументРазмещение.Дата                     = ТекущаяДата();
		НовыйДокументРазмещение.Склад                    = Склад;							
		НовыйДокументРазмещение.Ответственный            = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
		НовыйДокументРазмещение.НомерСкладскогоДокумента = НомерСкладскогоДокумента;
		НовыйДокументРазмещение.Клеверенс                = Истина;
		НовыйДокументРазмещение.Комментарий              = "Создан для передачи в ОП";
		
		ТаблицаТоваров = Товары.Выгрузить(,"Номенклатура,Количество");
		ТаблицаТоваров.Свернуть("Номенклатура","Количество"); 
		
		Для Каждого СтрокаТаблицыТоваров  Из ТаблицаТоваров Цикл
			
			Товар			     = НовыйДокументРазмещение.Товары.Добавить();	
			Товар.Номенклатура   = СтрокаТаблицыТоваров.Номенклатура;
			Товар.Количество     = СтрокаТаблицыТоваров.Количество;
			Товар.Ячейка         = ЯчейкаВиртуальногоРазмещенияТОХ;
			Товар.ВведеноВручную = Ложь;
			
		КонецЦикла;
		
		НовыйДокументРазмещение.Записать();

		Попытка
			
			НовыйДокументРазмещение.Записать(РежимЗаписиДокумента.Проведение);
			#Если Клиент Тогда 	 
			Сообщить("Записан документ " + СокрЛП(НовыйДокументРазмещение));
			#КонецЕсли    
		
		Исключение               
		
			#Если Клиент Тогда 	 
			Сообщить("При записи документа " + СокрЛП(НовыйДокументРазмещение) + " произошла ошибка "); 
			#КонецЕсли
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	//Создаем заказ покупателя
	
	НовыйЗаказНаПеремещениеВОП                         = Документы.ЗаказПокупателя.СоздатьДокумент();
	НовыйЗаказНаПеремещениеВОП.Дата                    = ТекущаяДата();
	НовыйЗаказНаПеремещениеВОП.ДатаОтгрузки            = ТекущаяДата();
	НовыйЗаказНаПеремещениеВОП.Ответственный           = ПараметрыСеанса.ТекущийПользователь;
	НовыйЗаказНаПеремещениеВОП.Организация             = Организация;
	НовыйЗаказНаПеремещениеВОП.Контрагент              = ГрузополучательТОХ.ГоловнойКонтрагент;
	НовыйЗаказНаПеремещениеВОП.Грузополучатель         = ГрузополучательТОХ;
	НовыйЗаказНаПеремещениеВОП.ДоговорКонтрагента      = ДоговорГрузополучателяТОХ;
	НовыйЗаказНаПеремещениеВОП.ДоговорПоставщикаТОХ    = ДоговорКонтрагента; 
	НовыйЗаказНаПеремещениеВОП.ТипЦен                  = ДоговорГрузополучателяТОХ.ТипЦен;
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйЗаказНаПеремещениеВОП, ПараметрыСеанса.ТекущийПользователь, 
	             НовыйЗаказНаПеремещениеВОП.мВалютаРегламентированногоУчета, "Продажа", Неопределено, Неопределено, 
				 НовыйЗаказНаПеремещениеВОП.мСтруктураПараметровДляПолученияДоговора);
	
	НовыйЗаказНаПеремещениеВОП.СпособДоставки          = Перечисления.СпособДоставки.Самовывоз;
	НовыйЗаказНаПеремещениеВОП.СкладГруппа             = Склад;
	НовыйЗаказНаПеремещениеВОП.IDСклада                = ?(Константы.FTPВыгрузкаОстатковКаталог.Получить() = "", 1, Число(Константы.FTPВыгрузкаОстатковКаталог.Получить()));
	НовыйЗаказНаПеремещениеВОП.УчитыватьНДС            = Истина;
	НовыйЗаказНаПеремещениеВОП.СуммаВключаетНДС        = Истина;
	НовыйЗаказНаПеремещениеВОП.ВалютаДокумента         = НовыйЗаказНаПеремещениеВОП.мВалютаРегламентированногоУчета;
	НовыйЗаказНаПеремещениеВОП.КратностьВзаиморасчетов = 1;
	НовыйЗаказНаПеремещениеВОП.КурсВзаиморасчетов      = 1; 
	НовыйЗаказНаПеремещениеВОП.Комментарий             = "Создан для передачи в ОП";

	Для Каждого СтрокаТаблЧастиТовары Из Ссылка.Товары Цикл
		
		НоваяСтрокаЗаказа = НовыйЗаказНаПеремещениеВОП.Товары.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаказа,СтрокаТаблЧастиТовары);		
		НоваяСтрокаЗаказа.Размещение = Склад;
		//+Гавриленков В. 18.12.2025 #UT10-5598
		//НоваяСтрокаЗаказа.СтавкаНДС = НоваяСтрокаЗаказа.Номенклатура.СтавкаНДС;
		НоваяСтрокаЗаказа.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НоваяСтрокаЗаказа.Номенклатура, НовыйЗаказНаПеремещениеВОП.Дата);
		//-Гавриленков В. 18.12.2025 #UT10-5598
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаЗаказа, НовыйЗаказНаПеремещениеВОП);
		
	КонецЦикла;
	
	НовыйЗаказНаПеремещениеВОП.Записать();
	
	Попытка
		
		НовыйЗаказНаПеремещениеВОП.Записать(РежимЗаписиДокумента.Проведение); 
		#Если Клиент Тогда 	 
			Сообщить("Записан документ " + СокрЛП(НовыйЗаказНаПеремещениеВОП)); 
		#КонецЕсли
		ЗаказНаперемещениеВОП = НовыйЗаказНаПеремещениеВОП.Ссылка;
		Записать();
		
	Исключение                  
		#Если Клиент Тогда 	 
			Сообщить("При записи документа " + СокрЛП(НовыйЗаказНаПеремещениеВОП)+" произошла ошибка "); 
		#КонецЕсли
		Отказ = Истина;
		Возврат;
		
	КонецПопытки;
	
	// Создаем документи сборка
	НовыйДокументСборкаЗаказов 					         = Документы.СборкаЗаказовПокупателя.СоздатьДокумент();
	НовыйДокументСборкаЗаказов.Дата				         = ТекущаяДата();
	НовыйДокументСборкаЗаказов.Ответственный             = Справочники.ФизическиеЛица.Автосборка;
	НовыйДокументСборкаЗаказов.ВремяНачалаСборки         = ТекущаяДата();
	НовыйДокументСборкаЗаказов.ВремяОкончанияСборки      = ТекущаяДата();
	НовыйДокументСборкаЗаказов.ДокументСобранИУпакован   = Истина; 
	НовыйДокументСборкаЗаказов.КоличествоУпаковочныхМест = 1;
	НовыйДокументСборкаЗаказов.Контрагент 		         = ГрузополучательТОХ.ГоловнойКонтрагент;
	НовыйДокументСборкаЗаказов.Грузополучатель 	         = ГрузополучательТОХ; 
	НовыйДокументСборкаЗаказов.Договор 			         = ДоговорГрузополучателяТОХ;
	НовыйДокументСборкаЗаказов.СпособДоставки 	         = Перечисления.СпособДоставки.Самовывоз;
	НовыйДокументСборкаЗаказов.ВремяНачалаСборки         = ТекущаяДата();
	НовыйДокументСборкаЗаказов.ДатаДоставкиКлиенту       = ТекущаяДата();
	НовыйДокументСборкаЗаказов.Организация 		         = Организация; 
	НовыйДокументСборкаЗаказов.ДоговорПоставщикаТОХ      = ДоговорКонтрагента;

	ТоварыЗаказаПокупателя = ЗаказНаперемещениеВОП.Товары.Выгрузить(,"Номенклатура,Количество"); 
	ТоварыЗаказаПокупателя.Свернуть("Номенклатура","Количество"); 
	
	ТоварыЗаказаПокупателя.Колонки.Добавить("Заказ");
	ТоварыЗаказаПокупателя.ЗаполнитьЗначения(ЗаказНаперемещениеВОП.Ссылка,"Заказ");	
	
	ТоварыЗаказаПокупателя.Колонки.Добавить("Ячейка"); 
	ТоварыЗаказаПокупателя.ЗаполнитьЗначения(ЯчейкаВиртуальногоРазмещенияТОХ,"Ячейка");
	
	ТоварыЗаказаПокупателя.Колонки.Добавить("Подборка");
	ТоварыЗаказаПокупателя.ЗаполнитьЗначения(Перечисления.ПодборкаНоменклатуры.Собрано,"Подборка");	
	
	ТоварыЗаказаПокупателя.Колонки.Добавить("Факт");

	Для Каждого ПромСтрокаТоварыЗаказа Из ТоварыЗаказаПокупателя Цикл
		ПромСтрокаТоварыЗаказа.Факт = ПромСтрокаТоварыЗаказа.Количество;
	КонецЦикла;
	
	Для Каждого СтрокаТоварыЗаказаПокупателя Из ТоварыЗаказаПокупателя Цикл
		
		НоваяСтрокаСборкиЗаказов = НовыйДокументСборкаЗаказов.Заказано.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСборкиЗаказов,СтрокаТоварыЗаказаПокупателя);
		
	КонецЦикла;
	
    НовыйДокументСборкаЗаказов.Записать();
	
	Попытка
		
		НовыйДокументСборкаЗаказов.Записать(РежимЗаписиДокумента.Проведение);
		#Если Клиент Тогда 	
		Сообщить("Записан документ " + СокрЛП(НовыйДокументСборкаЗаказов));  
		#КонецЕсли
		
	Исключение
		#Если Клиент Тогда 	
		Сообщить("При записи документа " + СокрЛП(НовыйДокументСборкаЗаказов)+" произошла ошибка ");
		#КонецЕсли
		Отказ = Истина;
		Возврат;
		
	КонецПопытки;
	
	// Создаем документ реализация 
	НовыйДокументРеализация									= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокументРеализация.Дата							= ТекущаяДата(); 
	НовыйДокументРеализация.ВидОперации 					= Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия ;
	НовыйДокументРеализация.Организация 					= Организация; 
	
	Если НовыйДокументРеализация.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
		
		НовыйДокументРеализация.ОтражатьВБухгалтерскомУчете = Истина;
		НовыйДокументРеализация.ОтражатьВНалоговомУчете     = Истина;
		
	КонецЕсли;				  
	
	НовыйДокументРеализация.Контрагент 					    = ГрузополучательТОХ.ГоловнойКонтрагент;
	НовыйДокументРеализация.ДоговорКонтрагента 			    = ДоговорГрузополучателяТОХ; 
	НовыйДокументРеализация.БанковскийСчетОрганизации 	    = Организация.ОсновнойБанковскийСчет; 
	НовыйДокументРеализация.Грузополучатель				    = ГрузополучательТОХ; 
	НовыйДокументРеализация.Склад   						= Склад;
	НовыйДокументРеализация.ОтражатьВУправленческомУчете    = Истина;
	НовыйДокументРеализация.ВалютаДокумента 			    = ДоговорГрузополучателяТОХ.ВалютаВзаиморасчетов;
	НовыйДокументРеализация.УчитыватьНДС 				    = Истина;
	НовыйДокументРеализация.СуммаВключаетНДС 			    = Истина;
	НовыйДокументРеализация.КурсВзаиморасчетов  		    = 1;
	НовыйДокументРеализация.КратностьВзаиморасчетов 	    = 1;
	НовыйДокументРеализация.ВидПередачи 				    = Перечисления.ВидыПередачиТоваров.СоСклада;
	НовыйДокументРеализация.Ответственный 			        = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокументРеализация.ДоговорПоставщикаТОХ            = ДоговорКонтрагента; 
	НовыйДокументРеализация.Комментарий                     = "Создан для передачи в ОП";

	Для Каждого СтрокаЗаказаНаПеремещение Из ЗаказНаперемещениеВОП.Товары Цикл
		
		НоваяСтрокаРеализации							   = НовыйДокументРеализация.Товары.Добавить(); 
		НоваяСтрокаРеализации.Номенклатура 			       = СтрокаЗаказаНаПеремещение.Номенклатура;
		НоваяСтрокаРеализации.СерияНоменклатуры 	       = СтрокаЗаказаНаПеремещение.СерияНоменклатуры;
		НоваяСтрокаРеализации.ЕдиницаИзмерения 		       = СтрокаЗаказаНаПеремещение.ЕдиницаИзмерения ;
		НоваяСтрокаРеализации.Коэффициент 			       = СтрокаЗаказаНаПеремещение.Коэффициент;
		НоваяСтрокаРеализации.Количество 			       = СтрокаЗаказаНаПеремещение.Количество;
		НоваяСтрокаРеализации.ЗаказПокупателя 		       = ЗаказНаперемещениеВОП.Ссылка ;
		НоваяСтрокаРеализации.Цена 					       = СтрокаЗаказаНаПеремещение.Цена;
		НоваяСтрокаРеализации.СтавкаНДС 			       = СтрокаЗаказаНаПеремещение.СтавкаНДС ;
		НоваяСтрокаРеализации.Сумма 				       = НоваяСтрокаРеализации.Количество*СтрокаЗаказаНаПеремещение.Цена;
		НоваяСтрокаРеализации.СуммаНДС 					   = УчетНДС.РассчитатьСуммуНДС(НоваяСтрокаРеализации.Сумма, Истина, Истина, 
		                                                     УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаРеализации.СтавкаНДС));
		НоваяСтрокаРеализации.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
		
	КонецЦикла;
	
	НовыйДокументРеализация.ЗаполнитьЯчейки();

	НоваяСтрокаСборкиРеализация = НовыйДокументРеализация.ДокументыСборкиЗаказов.Добавить();
	НоваяСтрокаСборкиРеализация.ДокументСборки = НовыйДокументСборкаЗаказов.Ссылка;
	
	НовыйДокументРеализация.Записать();

	Попытка
		
		НовыйДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);  
		
		Если НовыйДокументРеализация.ОтражатьВБухгалтерскомУчете И НовыйДокументРеализация.Проведен Тогда
			
			Если УчетНДС.ДопустимоСозданиеСчетаФактурыПоПараметруКроссДокинг(НовыйДокументРеализация.Ссылка) 
				И УчетНДС.ДопустимоСозданиеСчетаФактурыПоПараметруОформлятьРеализацииКакВнутреннееПеремещение(НовыйДокументРеализация.Ссылка) 										
				И УчетНДС.ДопустимоСозданиеСчетаФактурыПоОбособленномуПодразделению(НовыйДокументРеализация.Ссылка) 
				И НЕ НовыйДокументРеализация.Контрагент = Константы.КонтрагентВодитель.Получить() Тогда
				
				ДокСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
				ДокСФ.Дата = НовыйДокументРеализация.Дата + 1;	
				ДокСФ.Выставлен = Истина;
				ДокСФ.ДатаВыставления = ТекущаяДата();
				ДокСФ.ДокументыОснования.Очистить();
				ДокСФ.Заполнить(НовыйДокументРеализация.Ссылка);
				ДокСФ.ДатаНомерДокументовОплаты.Добавить();
				ДокСФ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ДокСФ.Записать(РежимЗаписиДокумента.Проведение);  
				
			КонецЕсли;
			
		КонецЕсли; 
		
		#Если Клиент Тогда 		
			Сообщить("Записан документ " + СокрЛП(НовыйДокументРеализация));
		#КонецЕсли

	Исключение
		
		#Если Клиент Тогда
		Сообщить("При записи документа " + СокрЛП(НовыйДокументРеализация)+" произошла ошибка "); 
		#КонецЕсли
		Отказ = Истина;
		Возврат;
		
	КонецПопытки;

КонецПроцедуры

	
мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);
